app/controllers/companies_controller.rb

  def index
    @companies = Company.all
---
SELECT * FROM `companies`

  def create
    @company = Company.new(params[:company])

    respond_to do |format|
      if @company.save
---
INSERT INTO `companies` (`description`, `updated_at`, `name`, `created_at`) VALUES('Parampampam', '2015-03-20 08:23:11', 'Parampampam', '2015-03-20 08:23:11')

  def update
    respond_to do |format|
      if @company.update_attributes(params[:company])
---
UPDATE `companies` SET `description` = 'Scand description pam pam', `updated_at` = '2015-03-19 16:38:49' WHERE `id` = 1

  def data
    @companies = Company.all
---
SELECT * FROM `companies`

  def dbaction
    #called for all db actions
    ids = params["ids"]
    name        = params[ids + "_c0"]
    description = params[ids + "_c1"]

    logger.debug "Params: name - #{name} description - #{description}"

    @mode = params[ids + "_!nativeeditor_status"]
    logger.debug "Mode: #{@mode}"

    @id = params[ids + "_gr_id"]
    logger.debug "Id: #{@id}"

    case @mode
      when "inserted"
        company = Company.new
        company.name = name
        company.description = description
        company.save!

        @tid = company.id
      when "deleted"
        company=Company.find(@id)
---
INSERT INTO `companies` (`updated_at`, `description`, `created_at`, `name`) VALUES('2015-03-20 13:56:23', '', '2015-03-20 13:56:23', 'parampamapamaa')
SELECT * FROM `companies` WHERE (`companies`.`id` = 5)

        company=Company.find(@id)
        company.name = name
        company.description = description
        company.save!
---
UPDATE `companies` SET `description` = 'dfgdfgdfgdfgdfg', `updated_at` = '2015-03-20 13:56:27' WHERE `id` = 5

    def find_company
      @company = Company.find(params[:id])
---
SELECT * FROM `companies` WHERE (`companies`.`id` = 1)