app/controllers/factories_controller.rb

  def show
    @factory = @company.factories.find(params[:id])
---
SELECT * FROM `factories` WHERE (`factories`.`id` = 1 AND (`factories`.company_id = 1))

  def create
    @factory = @company.factories.build(params[:factory])
    if @factory.save
---
INSERT INTO `factories` (`company_id`, `description`, `updated_at`, `name`, `created_at`) VALUES(3, '222222', '2015-03-20 08:21:37', '111111', '2015-03-20 08:21:37')

  def edit
    @factory = @company.factories.find(params[:id])
---
SELECT * FROM `factories` WHERE (`factories`.`id` = 1 AND (`factories`.company_id = 1))

  def data
    @factories = Factory.all
---
SELECT * FROM `factories`

    def find_factory
      @factory = Factory.find(params[:id])
---
SELECT * FROM `factories` WHERE (`factories`.company_id = 1)

    def find_company
      @company = Company.find(params[:company_id])
---
SELECT * FROM `companies` WHERE (`companies`.`id` = 3)