app/controllers/products_controller.rb

SELECT * FROM `products` WHERE (`products`.`id` = 1 AND (`products`.factory_id = 1))
SELECT * FROM `factories` WHERE (`factories`.`id` = 1)
---
  def show
    @product = Product.find(params[:id])
    @factory = Factory.find(@product.factory_id)

INSERT INTO `products` (`created_at`, `factory_id`, `description`, `name`, `updated_at`) VALUES('2015-03-19 14:48:16', 1, 'Created product from form', 'Form product', '2015-03-19 14:48:16')
---
  def create
    @product = @factory.products.build(params[:product])
    if @product.save

SELECT * FROM `products` WHERE (`products`.`id` = 1 AND (`products`.factory_id = 1))
---
  def edit
    @product = @factory.products.find(params[:id])

SELECT * FROM `products`
---
  def data
    @products = Product.all

SELECT * FROM `products` WHERE (`products`.factory_id = 1)
---
    def find_product
      @product = Product.find(params[:id])

SELECT * FROM `factories` WHERE (`factories`.`id` = 1)
---
    def find_factory
      @factory = Factory.find(params[:factory_id])

SELECT * FROM `companies` WHERE (`companies`.`id` = 1)
---
    def find_company
      @factory ||= Factory.find(params[:factory_id])
      @company = Company.find(@factory.company_id)